<a href="https://colab.research.google.com/github/Vanya-Kir/data_analysis/blob/main/lab_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Кириллов Иван (ИВТМ-01-22)

#### Task 8.
1. Найдите максимальную разницу между медианами суммы транзакций, посчитанными при заданных ниже условиях по полю amount из таблицы transactions (\*):
    - Медиана суммы транзакций
    - Медиана суммы транзакций по тем строкам, которые ни в одном из своих столбцов не содержат пустые значения
    - Медиана суммы транзакций по строкам, отсортированным по полю amount в порядке возрастания, и из которых удалены дублирующиеся по столбцам [mcc_code, tr_type] строки, причём при удалении соответстующих дублей остаются только последние из дублирующихся строк (keep='last')

Выведите ответ в виде вещественного числа, округлённого до двух знаков после запятой, отделив дробную часть точкой в формате "123.45"

##### Пояснения:
(\*) Для вычисления максимальной разницы между значениями списка можно использовать функцию np.ptp  
(\**) Если в результате получились значения [1,3,5], то макимальная разница между ними 4 == 5-1.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# !необходимо загрузить файл transactions.csv
data = pd.read_csv('/content/sample_data/transactions.csv')
data.head()

   customer_id tr_datetime  mcc_code  tr_type    amount term_id
0     39026145  0 10:23:26      4814     1030  -2245.92     NaN
1     39026145  1 10:19:29      6011     7010  56147.89     NaN
2     39026145  1 10:20:56      4829     2330 -56147.89     NaN
3     39026145  1 10:39:54      5499     1010  -1392.47     NaN
4     39026145  2 15:33:42      5499     1010   -920.83     NaN

In [ ]:
# Медиана суммы транзакций
mediana_1 = data.amount.median()
mediana_1

-5480.03

In [ ]:
# Медиана суммы транзакций по тем строкам, которые ни в одном из своих столбцов не содержат пустые значения
df_2 = data.dropna()
mediana_2 = df_2.amount.median()
mediana_2

-5322.82

In [ ]:
# Медиана суммы транзакций по строкам, отсортированным по полю amount в порядке возрастания, 
# и из которых удалены дублирующиеся по столбцам [mcc_code, tr_type] строки, причём при удалении 
# соответстующих дублей остаются только последние из дублирующихся строк (keep='last')
df_3 = data.sort_values(by='amount')
df_3 = df_3.drop_duplicates (['mcc_code', 'tr_type'], keep='last')
mediana_3 = df_3.amount.median()
mediana_3

-113.42

In [ ]:
# Результат
print(f'{np.ptp([mediana_1, mediana_2, mediana_3]):.2f}')

5366.61